In [2]:
import pandas as pd 

data_list = [["Carlos", 25, "Lima"], ["Freddy", 30, "Piura"], ["Ana", 28, "Trujillo"], ["Lucia", 35, "Ica"]]
df = pd.DataFrame(data_list, columns = ["Name", "Age", "City"])
df

     Name  Age      City
0  Carlos   25      Lima
1  Freddy   30     Piura
2     Ana   28  Trujillo
3   Lucia   35       Ica

In [3]:
df[df["Name"]=="Carlos"]

     Name  Age  City
0  Carlos   25  Lima

In [ ]:
type(df)

In [ ]:
t = df[['Name']] # retorna columna
t

In [4]:
df[df["Name"].str.startswith("L")]

    Name  Age City
3  Lucia   35  Ica

In [5]:
df.loc[df["Age"]>28]

     Name  Age   City
1  Freddy   30  Piura
3   Lucia   35    Ica

df.loc[df["Age"]>28, ["Name", "City"]] #Incluye solo a Name y City